## 통계분석_1

In [1]:
import pandas as pd
import numpy as np

## 빈도분석, 분포분석 (기초통계량 Set)

In [3]:
df = pd.read_csv('data/titanic_simple.csv')
df.head(2)

,PassengerId,Survived,Pclass,Name,Sex,Age,Fare,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,7.2500,Southhampton
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,71.2833,Cherbourg

In [4]:
df.shape

(891, 8)

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 8 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   Fare         891 non-null    float64
 7   Embarked     889 non-null    object
dtypes: float64(2), int64(3), object(3)
memory usage: 55.8+ KB

In [8]:
# type별로 컬럼 분류
col_id = ['PassengerId','Name']
col_cat = ['Survived','Sex','Embarked','Pclass']
col_num = ['Age','Fare']

In [20]:
# dtypes 맞춰주는 중

# 연속형
df[col_num] = df[col_num].astype('int',errors = 'ignore')

# 고윳값
df[col_id] = df[col_id].astype('str')

# 범주형
for i in col_cat:
    df[i] = pd.Categorical(df[i])

In [21]:
df.dtypes

PassengerId      object
Survived       category
Pclass         category
Name             object
Sex            category
Age             float64
Fare            float64
Embarked       category
dtype: object

In [22]:
df.head(2)

,PassengerId,Survived,Pclass,Name,Sex,Age,Fare,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,7.2500,Southhampton
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,71.2833,Cherbourg

## 기초통계량 Set

In [33]:
x = df.describe(percentiles= [0.01, 0.05, 0.1, 0.25, 0.5, 0.75, 0.9, 0.95, 0.99])
x.T

,count,mean,std,min,1%,5%,10%,25%,50%,75%,90%,95%,99%,max
Age,714.0,29.699118,14.526497,0.42,1.0,4.000,14.00,20.1250,28.0000,38.0,50.0000,56.00000,65.87000,80.0000
Fare,891.0,32.204208,49.693429,0.00,0.0,7.225,7.55,7.9104,14.4542,31.0,77.9583,112.07915,249.00622,512.3292

In [35]:
df1 = df.isna().sum()
df1.name = 'missing'

In [36]:
df1

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
Fare             0
Embarked         2
Name: missing, dtype: int64